events/Data Storage Events/Metadata.issue/real example/ALERT.KESI.IssueNew.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/kesi</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>KESI</ns1:sender>
							<ns1:timestamp>10003</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10020</ns1:endTime>
								<ns1:eventName>ALERT.KESI.IssueNew</ns1:eventName>
								<ns1:eventId>5748</ns1:eventId>
								<ns1:eventType>request</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
                                                                <s:issue>
                                                                        <s:issueId>184671</s:issueId>
                                                                        <s:issueAuthor>
                                                                                <s:name>Alex Fiestas</s:name>
                                                                                <s:id>afiestas@kde.org</s:id>
                                                                                <s:email>afiestas@kde.org</s:email>
                                                                        </s:issueAuthor>
                                                                        <s:issueStatus>Assigned</s:issueStatus>
                                                                        <s:issueDescription>Notify user on hardware changes 2</s:issueDescription>
                                                                        <s:issueKeyword>keyword</s:issueKeyword>
                                                                        <s:issueProduct>
                                                                                <s:productId>solid</s:productId>
                                                                                <s:productComponentId>general</s:productComponentId>
                                                                                <s:productVersion>unspecified</s:productVersion>
                                                                        </s:issueProduct>
                                                                        <s:issueComputerSystem>
                                                                                <s:computerSystemPlatform>Ubuntu Packages</s:computerSystemPlatform>
                                                                                <s:computerSystemOS>Linux</s:computerSystemOS>
                                                                        </s:issueComputerSystem>
                                                                        <s:issuePriority>4</s:issuePriority>
                                                                        <s:issueSeverity>Blocker</s:issueSeverity>
                                                                        <s:issueAssignedTo>
                                                                                <s:name>Sander Pientka</s:name>
                                                                                <s:id>cumulus0007@gmail.com</s:id>
                                                                                <s:email>cumulus0007@gmail.com</s:email>
                                                                        </s:issueAssignedTo>
                                                                        <s:issueCCPerson>
                                                                                <s:name>Angel Blue</s:name>
                                                                                <s:id>angel_blue_co2004@yahoo.com</s:id>
                                                                                <s:email>angel_blue_co2004@yahoo.com</s:email>
                                                                        </s:issueCCPerson>
                                                                        <s:issueUrl>https://bugs.kde.org/show_bug.cgi?id=184671</s:issueUrl>
                                                                        <s:issueDependsOnId>10001</s:issueDependsOnId>
                                                                        <s:issueBlocksId>20001</s:issueBlocksId>
                                                                        <s:issueDateOpened>2009-02-17 16:31</s:issueDateOpened>
                                                                        <s:issueComment>
                                                                                <s:commentNumber>0</s:commentNumber>
                                                                                <s:commentText>Version: (using KDE 4.2.0) OS: Linux Installed from: Ubuntu Packages It would be awesome if KDE notifies te user of newly installed hardware, missing drivers, programs to use the connected device, etc.</s:commentText>
                                                                                <s:commentPerson>
                                                                                        <s:name>Alex Fiestas</s:name>
                                                                                        <s:id>afiestas@kde.org</s:id>
                                                                                        <s:email>afiestas@kde.org</s:email>
                                                                                </s:commentPerson>
                                                                                <s:commentDate>2009-02-17 16:31:37</s:commentDate>
                                                                        </s:issueComment>
                                                                        <s:issueAttachment>
                                                                                <s:attachmentId>3532</s:attachmentId>
                                                                                <s:attachmentFilename>name</s:attachmentFilename>
                                                                                <s:attachmentType>doc</s:attachmentType>
                                                                                <s:attachmentCreator>
                                                                                        <s:name>Alex Fiestas</s:name>
                                                                                        <s:id>afiestas@kde.org</s:id>
                                                                                        <s:email>afiestas@kde.org</s:email>
                                                                                </s:attachmentCreator>
                                                                        </s:issueAttachment>
                                                                        <s:issueTracker>
                                                                                <s:issueTrackerId>241</s:issueTrackerId>
                                                                                <s:issueTrackerType>bugzilla</s:issueTrackerType>
                                                                                <s:issueTrackerURL>https://bugs.kde.org/</s:issueTrackerURL>
                                                                        </s:issueTracker>
                                                                </s:issue>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>